app/controllers/school_classes_controller.rb

  def update
    @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2018-07-22 23:54:07.082425"], ["id", 4]]

  def destroy
    @school_class.destroy
---
DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 1]]