app/controllers/students_controller.rb

  def update
    student = Student.find(params[:id])
    student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-07-23 21:59:25.566113"], ["id", 1]]